Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: དེ་ནས་ལངས་ནས་རྨི་ལམ་དུ་གྲུབ་པའི་མཚན་མ་མཐོང་ན་རིང་པོ་མི་ཐོགས་པར་རས་རིས་བྲི་བར་བྱའོ། །
en: Upon awakening, one should commission the painting without delay if one’s dreams indicated success.

source: གལ་ཏེ་གྲུབ་པའི་མཚན་མ་རྨི་ལམ་དུ་མ་མཐོང་ན། རས་དེ་སྣོད་དེ་ལས་ཕྱུང་ལ་ཉི་མ་ལ་བསྐམས་ནས་ཡང་སྣོད་སར་པ་གཞན་དུ་བཅུག་ལ།
en: If the dreams conveyed no sign of success, one should take the cloth out of the vessel and dry it in the sun. When dry, one should again place it in a different new vessel.

source: ཤིན་ཏུ་དབེན་པར་ལེགས་པར་བསྲུང་བ་བྱས་ལ་བཞག་གོ། །
en: One should keep it well hidden, and also do the protection rite over it.

source: དེ་ནས་ཡང་སྙིང་པོའི་མཆོག་དེ་དག་ལས་གང་ཡང་རུང་བའི་སྔགས་བླངས་ལ། གང་འདོད་པའི་ཡི་གེ་དྲུག་པ་ཡང་ཡི་གེ་འབུམ་བཟླ་བར་བྱའོ། །
en: Then, choosing whichever among the six-syllable heart mantras given previously one wishes, recite its syllables one hundred thousand times.

source: དེས་ན་རས་མི་དགེ་བ་ཡང་འགྲུབ་པར་འགྱུར་རོ། །
en: One will then be able to swiftly accomplish the cloth-painting procedure. {7.13}

source: དང་པོར་རེ་ཞིག་རས་དེ་བླངས་ལ་ཆོ་འཕྲུལ་གྱི་ཟླ་ཕྱེད་དམ། ཡར་ངོའི་ཉིན་ཞག་ལ་རྒྱུ་སྐར་བཟང་པོ་དང་ལྡན་པའི་གྲངས་བཟང་པོ་ལ།
en: “To begin, one should take this cloth, and, during the prātihāra fortnight, or any day during the bright fortnight when the stars are auspicious, and during an auspicious lunar asterism,

source: འཕགས་པ་འཇམ་དཔལ་བྱིས་པ་ཁྱེའུ་ཡི་གཟུགས་ཅན་མགོ་ཟུར་ཕུད་ལྔ་དང་ལྡན་པ། བྱིས་པའི་རྒྱན་གྱིས་བརྒྱན་པ་མདོག་གསེར་འདྲ་བ། ན་བཟའ་སྔོན་པོ་གཡོ་བཞིན་པ་མནབས་པ། ན་བཟའ་དར་ལ་སྔོན་པོས་སྟོད་གཡོགས་བྱས་པ།
en: “The painter should first paint Noble Mañjuśrī with the form of a young boy, his hair in five locks, and dressed with all the adornments of a boy. Golden in color, he wears short trousers and a shirt of blue silk.

source: ཆོས་འཆད་པ་སེང་གེའི་ཁྲི་ལ་སྐྱིལ་མོ་ཀྲུང་ཕྱེད་པས་བཞུགས་ལ། ཞབས་གཡས་པས་རིན་པོ་ཆེའི་ཞབས་རྟེན་ལ་བཞག་པ། གཡོན་པ་སེང་གེའི་གདན་ལ་བཞུགས་པ།
en: He expounds the Dharma while sitting on a lion throne in the cross-legged posture with his right foot placed on a jeweled footstool and his left on the seat of the lion throne.

source: རྒྱན་ཐམས་ཅད་དང་ལྡན་པ་བཞིན་ཅུང་ཟད་འཛུམ་པ་དང་བཅས་པ། སྒྲུབ་པ་པོ་ལ་ལྟ་བ་བྲི་བར་བྱའོ། །
en: Adorned with all types of jewelry, he is of charming appearance. Smiling slightly, he is directing his gaze at the practitioner. {7.15}

source: གཡས་ཕྱོགས་སུ་འཕགས་པ་ཀུན་དུ་བཟང་པོ་རྔ་མ་དཀར་པོ་གཡོབ་པ།
en: “On his right side should be painted the noble Samantabhadra, waving a white yak-tail whisk.

source: པྲི་ཡང་ཀུའི་མདོག་ལྟར་སྔོ་བསངས་ལག་པ་གཡོན་པ་ན་ནོར་བུ་རིན་པོ་ཆེ་ཐོགས་པ།
en: He is of the dark blue color of the beautyberry flower. In his left hand he holds a wish-fulfilling gem.

source: ཡན་ལག་ཐམས་ཅད་མཛེས་པ། རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ།
en: He is beautiful in every limb and adorned with all types of jewelry.

source: ན་བཟའ་སྔོན་པོ་གཡོ་བ་མནབས་པ། མུ་ཏིག་གི་ཕྲེང་བས་མཆོད་ཕྱིར་ཐོགས་པ།
en: He wears short trousers of blue silk and is invested with the sacred thread made of a garland of pearls.

source: པདྨ་དཀར་པོའི་གདན་ལ་འདུག་པ་བྲི་བར་བྱའོ། །
en: He should be painted standing on a white lotus. {7.16}

source: འཕགས་པ་འཇམ་དཔལ་གྱི་གཡོན་ཕྱོགས་སུ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་སྟོན་ཀའི་ཟླ་རྒྱུའི་མདོག་ལྟར་དཀར་བ། ན་བཟའ་སྔོན་པོ་གཡོ་བ་མནབས་པ།
en: “The noble Avalokiteśvara, white as the autumn moon and wearing short trousers of blue silk, should be painted to left side of Noble Mañjuśrī.

source: ཡན་ལག་ཐམས་ཅད་མཛེས་པ། རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། མུ་ཏིག་གི་ཕྲེང་བས་མཆོད་ཕྱིར་ཐོགས་བྱས་པ།
en: Beautiful in his every limb and adorned with all types of jewelry, he is invested with the sacred thread made of a garland of pearls.

source: ལག་པ་གཡོན་པ་ན་པདྨ་དཀར་པོ་འཛིན་པ། ལག་པ་གཡས་པ་ན་རྔ་ཡབ་གསེར་གྱི་ཡུ་བ་ཅན་དཀར་པོ་ཐོགས་པ།
en: He holds a white lotus in his left hand, and with his right he holds a white yak-tail whisk with a golden handle, which he waves.

source: ཞི་བའི་ཆ་བྱད་ཅན་འཕགས་པ་འཇམ་དཔལ་ལ་ལྟ་བ། དེ་བཞིན་དུ་འཕགས་པ་ཀུན་དུ་བཟང་པོ་པདྨ་དཀར་པོ་ལ་གནས་པ། གཉི་ག་ཡང་དེ་ལྟར་བྲི་བར་བྱའོ། །
en: Peaceful in form, he, just like the noble Samantabhadra, directs his gaze at Noble Mañjuśrī. Both of them should be painted standing on white lotuses. {7.17}

source: དེ་ནས་སྡོང་བུ་གཅིག་ལས་སྐྱེས་པའི་པདྨ་གསུམ་ལ་དབུས་ཀྱི་རྩ་བའི་པདྨའི་གེ་སར་ལ་ནི་འཕགས་པ་འཇམ་དཔལ་གྱི་སེང་གེའི་ཁྲི་དང་རིན་པོ་ཆེའི་ཞབས་རྟེན་ནོ། །
en: “Next, three lotuses spring from a single stalk. On the pericarp of the middle, primary lotus is the lion throne of Noble Mañjuśrī and his jeweled footstool.

source: གཉིས་པའི་པདྨ་ལ་ནི་འཕགས་པ་ཀུན་དུ་བཟང་པོའོ། །
en: On the second lotus the noble Samantabhadra stands on a white lotus seat.

source: གསུམ་པའི་པདྨ་ལ་ནི་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གོ། །
en: On the third lotus is the noble Avalokiteśvara.

source: པདྨའི་སྡོང་བུ་མཛེས་པ་རིན་པོ་ཆེ་མརྒད་འདྲ་བ། པདྨའི་མེ་ཏོག་དུ་མ་ཁ་མ་བྱེ་བ་དང་། ཕྱེད་ཙམ་བྱེ་བ་དང་ཁ་བྱེ་བ་དང་ལྡན་པ། མཚོ་ཆེན་པོ་མ་དྲོས་པ་ལས་སྐྱེས་པ་ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་ཉེ་དགའ་གཉིས་པདྨའི་སྡོང་བུ་ལ་འཛིན་པ།
en: The beautiful, emerald-like stalk rises from Anavatapta Lake, which is covered in lotus buds with leaves, half-opened lotuses, and lotuses in full bloom. This lotus stalk is supported by two nāga kings, Nanda and Upananda. {7.18}

source: ཀླུའི་རྒྱལ་པོ་དེ་དག་གི་ཁ་དོག་དཀར་བ། གདེངས་ཀ་བདུན་གྱིས་ཉེ་བར་བརྒྱན་པ།
en: “These two nāga kings should be painted as white, each of them adorned with seven hoods.

source: ལུས་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། ལུས་ཀྱི་སྟོད་མི་ལ་སྦྲུལ་གྱི་གདེངས་ཀས་མཚན་པ།
en: Their bodies, adorned with all types of jewelry, are half human , and the other half is distinguished by the coils of a snake.

source: འཕགས་པ་འཇམ་དཔལ་ལ་ལྟ་བ། ལུས་ཕྱེད་ཆུའི་ནང་དུ་ནུབ་པ་ནོར་བུ་རིན་པོ་ཆེ་དང་གོས་ཀྱིས་ཉེ་བར་མཛེས་པ་བྲི་བར་བྱའོ། །
en: With their [lower] bodies submerged in water, they direct their gaze at Noble Mañjuśrī. They are shaded with parasols decorated with jewels. {7.19}

source: མཚོ་ཆེན་པོ་ཀུན་གྱི་འོག་ཏུ་སྒྲུབ་པ་པོ་རས་རིས་ཀྱི་གཡས་ཕྱོགས་ཀྱི་མཐའི་ཟུར་དུ་འཕགས་པ་འཇམ་དཔལ་གྱི་ཞལ་གྱི་དཀྱིལ་འཁོར་ལ་ལྟ་བ།
en: “In the right corner of the cloth, on the margins below the great lake, the practitioner should be painted looking at the orb of Noble Mañjuśrī’s face.

source: སྤོས་སྣོད་ལག་ན་ཐོགས་པ་མགོ་དང་པུས་མོའི་ལྷ་ང་འདུད་པ།
en: He holds an incense holder in his hand and inclines his head toward his knee.

source: ཆ་བྱད་དང་ཁ་དོག་སྔ་མ་ཅི་ལྟ་བ་བཞིན་བྲི་བར་བྱའོ། །
en: He should be depicted with all the respective details of dress and colors. {7.20}

source: འཕགས་པ་འཇམ་དཔལ་གྱི་སྟེང་རས་ཀྱི་ཟུར་གཉིས་སུ་ལྷའི་བུ་མེ་ཏོག་གི་ཕྲེང་བ་འཛིན་པ།
en: “Above Noble Mañjuśrī, in the two corners at the edge of the cloth, two divine sons wearing garlands and holding garlands of flowers should be painted.

source: ནམ་མཁའ་ལ་ལྡིང་བ། སྤྲིན་གྱི་ནང་ནས་བྱུང་བ། མེ་ཏོག་གི་ཚོགས་ཆེན་པོ་འཐོར་བ་ཤིན་ཏུ་མཛེས་པ་བྲི་བར་བྱའོ། །
en: They float nestled within clouds and release a great flood of flowers. Both are very beautiful.

source: རས་རིས་ཀྱི་འཁོར་ཡུག་ཏུ་མེ་ཏོག་ནཱ་ག་གེ་སར་ལ་སོགས་པས་རབ་ཏུ་གཏོར་བར་བྲི་བར་བྱའོ། །
en: Blossoms of the ironwood tree and so forth should be painted strewn all around the cloth.

source: ཅི་ལྟར་འདོད་པའི་གཟུགས་དེ་བཞིན་དུ་བྲི་བར་བྱའོ། །
en: “They may be painted as the practitioner pleases,

source: འཕགས་པ་འཇམ་དཔལ་ཆོས་འཆད་པ་དང་། འཕགས་པ་ཀུན་དུ་བཟང་པོ་དང་འཕགས་པ་སྤྱན་རས་གཟིགས་ལག་ན་རྔ་ཡབ་གཡོབ་པ་བྲི་བར་བྱའོ། །
en: but these three figures must be included—the noble Mañjuśrī expounding the Dharma and the noble Samantabhadra and Avalokiteśvara, both of whom are painted with yak-tail whisks in their hands.

source: ཡང་ན་སྒྲུབ་པ་པོ་ཅི་ལྟར་འདོད་པ་བཞིན་དུ་རས་རིས་ཀྱི་གཟུགས་ངེས་པར་བྲི་བར་བྱ་སྟེ།
en: Optionally, other forms may be added as desired, arranged according to their respective places.

source: ཅི་ལྟར་འདོད་པའི་ཆ་བྱད་དམ། ཅི་ལྟར་འདོད་པའི་དབྱིབས་སམ། སྒྲུབ་པ་པོ་ཅི་ལྟ་ཅི་ལྟར་འདོད་པ་དེ་ལྟ་དེ་ལྟར་བྲི་བར་བྱའོ། །
en: Whatever forms the practitioner finds agreeable, these forms may be painted. {7.22}

source: དབུས་སུ་འཕགས་པ་འཇམ་དཔལ་གཡས་གཡོན་དུ་འཕགས་པ་འཇིག་རྟེན་དབང་ཕྱུག་དང་། ཀུན་དུ་བཟང་པོ་ཅི་ལྟར་འདོད་པར་ངེས་པར་བྲི་བར་བྱའོ། །
en: “Noble Mañjuśrī should always be painted in the middle, with the noble Avalokiteśvara and Samantabhadra on either side. The other forms, however, can be painted as preferred.

source: ཡང་ན་ཅི་རྙེད་པའི་རས་ཀྱི་དུམ་བུ་མཐོ་གང་ངམ། ཁྲུ་གང་ལ་བདག་ཉིད་དམ་གཞན་གྱིས་སམ། རི་མོ་མཁན་གསོ་སྦྱོང་བྱས་པའམ་གསོ་སྦྱོང་མ་བྱས་པ་དད་པའམ་མ་དད་པའམ། གཙང་བ་འམ་མི་གཙང་བ་འམ། ཚུལ་ཁྲིམས་དང་ལྡན་པ་འམ་ཚུལ་ཁྲིམས་འཆལ་པའི་རི་མོ་མཁན་གྱིས་ཀྱང་བྲི་བར་བྱའོ། །
en: One can also use any piece of cloth as available, which could be one vitasti or one cubit in size and either do the painting oneself or have it done by any painter whether he observes the fast or not, has faith or not, is pure or impure, or of good or bad morals.

source: བདག་ཉིད་དམ་སྒྲུབ་པ་པོས་ངེས་པར་སྔོན་དུ་བསྙེན་པ་བྱས་པ་དང་། དད་པ་དང་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ནི་ངེས་པར་བྱའོ། །
en: If, however, the practitioner does the painting himself, he must certainly first complete the preparatory rites, have faith, and have given rise to bodhicitta. {7.23}

source: དེ་ལྟར་བྱས་ན་སྔགས་འགྲུབ་པར་འགྱུར་གྱི་གཞན་དུ་སྡིག་པའི་ལས་ཅན་གྱིས་ནི་མི་འགྱུར་ཏེ།
en: “In this way the mantras will be accomplished, But not for those who commit evil.

source: དེ་ལྟར་དད་པ་དང་དེ་ལྟར་གྱུར་པས་བསྒྲུབ་པར་བྱའོ། །
en: Accordingly, once faith has been developed, The mantra deities will be accomplished. {7.24}

source: སྔགས་ཀྱི་རྒྱལ་པོ་དང་སྔགས་ཀྱི་ལྷ་དག་འདིར་དད་པ་དང་ལྡན་པས་འགྲུབ་པར་འགྱུར་གྱི་གཞན་དག་གིས་ནི་མ་ཡིན་ནོ། །
en: “The mantra kings will be accomplished through this ritual Only by those who have faith, not otherwise,

source: གང་ཕྱིར་དད་པ་ཐེག་པ་མཆོག །གང་གིས་རྣམ་པར་འདྲེན་པ་མཆོག །
en: Because faith is the supreme vehicle Traveled in by the spiritual guides themselves. {7.25}

source: དད་པ་མེད་པའི་མི་ལ་ནི། །དཀར་པོའི་ཆོས་རྣམས་མི་སྐྱེ་སྟེ། །
en: “For a person without faith The white Dharma will not grow,

source: ས་བོན་ཚིག་པར་གྱུར་པ་ལས། །མྱུ་གུ་སྔོན་པོ་ཅི་བཞིན་ནོ། །
en: Just like green shoots From seeds burnt by fire. {7.26}

source: དད་དང་ལྡན་པའི་མི་དག་ལ། །སངས་རྒྱས་ལས་ནི་འགྲུབ་འགྱུར་ཏེ། །
en: “But if an ordinary person is confirmed in faith And has begun working toward awakening, He will accomplish the deities.

source: སྔགས་རྣམས་ཐམས་ཅད་ཁྱད་པར་དུ། །དད་པ་མེད་ལ་མི་འགྲུབ་བོ། །
en: If he has no faith, he will not. In particular, he will not Accomplish any mantras. {7.27}

source: གང་ཡང་འཇིག་རྟེན་ལྷ་དག་དང་། །དེ་བཞིན་འཇིག་རྟེན་འདས་པ་དག །དད་ལྡན་ཀུན་ལ་འགྲུབ་འགྱུར་ཏེ། །སྡིག་པ་དག་དང་བྲལ་ཕྱིར་རོ། །
en: “Whatever worldly deities there are, And whatever are beyond this world, All of them, free from stain, Will be accomplished by those with faith. {7.28}

source: བྱང་ཆུབ་དེར་སོང་ཡིད་ཀྱིས་ནི། །དེ་དག་མྱུར་དུ་ངེས་འགྲུབ་སྟེ། །
en: “Swiftly will they gain accomplishment, And their awakening is certain, if they direct their minds to it.

source: གཞན་ལ་འགྲུབ་པར་མི་འགྱུར་ཞིང་། །བསྟན་པ་འདི་ལ་རྣམ་པར་བཟློག །
en: No attainment is said to arise for the others Who have turned from this teaching. {7.29}

source: རས་ནི་ཆུང་དང་ཆེན་པོ་དང་། །འབྲིང་དུ་ཉེ་བར་བསྒྲགས་པ་ཡིན། །
en: “The painting procedures—the small, the special, And the middle—have now been taught.

source: ལས་རྣམས་ཀུན་ལ་སྒྲུབ་པ་ནི། །ད་ནི་རབ་ཏུ་བསྟན་པར་བྱ། །
en: Presently, I will teach the practice That accomplishes all activities.” {7.30}

source: བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཕལ་པོ་ཆེ་ཐེག་པ་ཆེན་པོ་ཤིན་ཏུ་རྒྱས་པའི་མདོ་ལས། འཕགས་པ་འཇམ་དཔལ་གྱི་རྩ་བའི་ཆོ་ག་བདུན་པའི་ལེའུ་རབ་འབྱམ་ལས། རས་རིས་ཀྱི་ཆོ་ག་བཞི་པའི་ལེའུ་རབ་འབྱམ་རྫོགས་སོ།། །།
en: This concludes the detailed seventh chapter, which is the detailed fourth chapter on the cloth-painting procedure, from “The Root Manual of Noble Mañjuśrī,” an extensive Mahāyāna sūtra that forms a basket of bodhisattva teachings.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ།
en: Now Lord Śākyamuni addressed Mañjuśrī, the divine youth:

source: འཇམ་དཔལ་གཞོན་ནུ་གང་ཁྱོད་ཀྱིས་བསྟན་པའི་སེམས་ཅན་དེ་དག་གི་ཕྱིར། ལེའུའི་ཆོ་ག་རབ་འབྱམ་འདི་ཐབས་སླ་བས་འགྲུབ་པར་འགྱུར་བ་ངས་ཀྱང་བསྟན་ཏེ
en: “The full topic of the cloth-painting procedure, Mañjuśrī, has now been taught by me for the benefit of those beings you foretold.

source: དེ་དག་གི་དོན་གྱི་ཕྱིར་ཡོན་ཏན་རྒྱ་ཆེ་བའི་བྱེ་བྲག་གི་དབྱེ་བ། ལས་རྣམ་པར་འབྱེད་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་གྱི་ཕྱིར་ཡང་དག་པར་བཤད་པར་བྱ་ཡིས། དེ་ལེགས་པར་ཤིན་ཏུ་རབ་ཏུ་ཉོན་ཅིག་དང་བཤད་པར་བྱའོ། །
en: They will succeed even with little skillful means. For their benefit I will now teach a sādhana method classified according to the type of activity, describing at length its different virtues. Listen to it well, and reflect upon it thoroughly. I will speak for the benefit of all beings.” {8.1}

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The divine youth Mañjuśrī, in turn, said to the Blessed One, “Good!

source: བདག་གི་ཚིག་གི་ནུས་པ་གསལ་བར་མཛད་ཅིང་། སྔགས་ཀྱི་སྤྱོད་པའི་ཡོན་ཏན་གྲུབ་པར་མཛད་པ་ནི་ལེགས་སོ་ལེགས་སོ་ཞེས་གསོལ་ཏོ། །
en: It is good, O Blessed One, that you will give this eloquent exposition that illuminates our incisive meditation and causes the qualities of mantra practice to fully manifest.

source: བཅོམ་ལྡན་འདས་དེའི་དུས་ལ་བབ་པར་མཁྱེན་ན་བདག་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་དེ་བཤད་དུ་གསོལ།
en: So do teach this method, Blessed One, if you think that the time is right. Do so out of compassion for us.” {8.2}

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་ལ་གཟིགས་ཏེ་འཛུམ་པ་མཛད་དོ། །
en: Lord Śākyamuni looked then at the entire assembly and smiled.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་སྔོན་པོ་དང་། སེར་པོ་དང་ལྗང་གུ་དང་ཤེལ་གྱི་ཁ་དོག་ལྟ་བུ་བྱུང་སྟེ།
en: At that moment rays of blue, yellow, and translucent crystalline light issued from the mouth of Lord Śākyamuni.

source: འོད་ཟེར་དེ་བྱུང་མ་ཐག་ཏུ་ཐམས་ཅད་དང་ལྡན་པའི་དཀྱིལ་འཁོར་སྣང་བར་བྱས་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བདུད་ཐམས་ཅད་ཟིལ་གྱིས་མནན་ནས།
en: As soon as these rays issued forth, they illuminated the entire assembly and dimmed the worldly realm of the great trichiliocosm, including the abodes of all the māras.

source: རྒྱུ་སྐར་གྱི་འོད་དང་རི་བོའི་ཚོགས་ཐམས་ཅད་ཀྱི་འོད་དང་། གང་འདི་ཟླ་བ་དང་ཉི་མ་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་དེ་དག་གི་འོད་ཀྱང་ཟིལ་གྱིས་མནན་ཏེ།
en: This included the light of the entire multitude of stars, celestial bodies, mountain ranges, and the moon and the sun, those two luminaries of great power and might, which were also dimmed by the light of Śākyamuni’s rays.

source: མི་གསལ་ཞིང་འོད་མེད་པར་འགྱུར་བ་དང་། རྣམ་པར་མཛེས་པར་མི་འགྱུར་ཞིང་གསལ་བར་མི་འགྱུར་རོ། །
en: They lost their radiance and did not illuminate the worlds. They did not shine and appeared dark.

source: ནོར་བུ་ཐམས་ཅད་དང་། སྔགས་དང་སྨན་དང་། རིན་པོ་ཆེའི་འོད་ཐམས་ཅད་འོད་མེད་པར་བྱས་ནས་སླར་ལོག་སྟེ། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་ཞལ་གྱི་སྒོར་ནུབ་པར་གྱུར་ཏོ། །
en: The rays dimmed also the jewel light of all gems, mantras, and medicines and then disappeared back into Lord Śākyamuni’s mouth. {8.3}

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱག་ན་རྡོ་རྗེ་འཁོར་གྱི་དཀྱིལ་འཁོར་དེ་ཉིད་དུ་འདུས་ཤིང་
en: Bodhisattva Vajrapāṇi, the great being, was present at that time in the midst of this great gathering.

source: འཁོད་པར་གྱུར་པ་དེ་སྟན་ལས་ལངས་ནས། རིངས་པའི་ཚུལ་གྱིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Seated, he rose from his seat in his beautiful form pleasing to beings, prostrated at the Blessed One’s feet, and said this to him:

source: བཅོམ་ལྡན་འདས་ནི་རྒྱུ་མ་མཆིས་རྐྱེན་མ་མཆིས་པར་འཛུམ་པ་མི་མཛད་ན།
en: “It is not without a cause or a reason that the blessed buddhas smile.

source: བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་པའི་རྒྱུ་གང་ལགས། རྐྱེན་གང་ལགས།
en: What is the cause, Blessed One, what is the reason for your smile?” {8.4}

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཕྱག་ན་རྡོ་རྗེ་ལ་བཀའ་སྩལ་པ། ཕྱག་ན་རྡོ་རྗེ་དེ་དེ་བཞིན་ནོ། །
en: Being thus asked, the Blessed One said to Bodhisattva Vajrapāṇi, “It is so, Vajrapāṇi, it is so.

source: དེ་དེ་བཞིན་ཏེ། ཅི་སྐད་སྨྲས་པ་དེ་བཞིན་ནོ། །
en: It is exactly as you say.

source: བཅོམ་ལྡན་འདས་ནི་རྒྱུ་མེད་པ་དང་། རྐྱེན་མེད་པར་འཛུམ་པ་མི་མཛད་དེ། རྒྱུ་ཡོད་རྐྱེན་ཡོད་དོ། །
en: The smile of the tathāgatas does not happen without a cause or a reason. There is a cause, there is a reason:

source: གང་ཞིག་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་འཇམ་དཔལ་གྱི་རྩ་བའི་ཆོ་ག་རིག་པའི་སྤྱོད་པ་རྗེས་སུ་སྒྲུབ་པ་ལས་སྒྲུབ་པའི་ཐབས་ལ་ཡང་དག་པར་གཞོལ་བ། ཆོས་ཀྱི་སྤྲིན་ལ་རྟེན་པ་ལ་ཡང་དག་པར་འཇུག་ཅིང་རྗེས་སུ་འབྲང་བར་བྱེད་པ་དང་།
en: future beings will take up and follow this king of the lords of sūtras, this root manual of Mañjuśrī, which arose out of the tenth bodhisattva level, Cloud of Dharma—a collection of skillful methods such as ritual practices that involve knowledge- vidyā s and practicing the right conduct.

source: འཛིན་པར་འགྱུར་བ་དང་། ཀློག་པར་འགྱུར་བ་དང་། དད་པར་འགྱུར་བ་དང་། གླེགས་བམ་ལ་འདྲི་བ་བྱས་ནས་
en: Future beings will study this manual in full, memorize it, spread it by word of mouth, and put their faith in it. {8.5}

source: མཆོད་པར་འགྱུར་བ་དང་། ཙནྡན་གྱི་ཕྱེ་མ་དང་བྱུག་པ་དང་། བདུག་པ་དང་། ཕྲེང་བ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམ་པ་སྣ་ཚོགས་པའམ། ཚིག་གི་བྱེ་བྲག་གིས་སམ། སིལ་སྙན་རྣམ་པ་སྣ་ཚོགས་དང་། ཕེག་རྡོབ་པ་དག་གམ་ཐ་ན་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་སེམས་རྒྱུད་ལ་ཐོབ་པ་འམ། བ་སྤུ་ལྡང་བར་བྱེད་པ་འམ།
en: “Having written it down in the form of a book, they will worship it with sandalwood powder, ointments, incense, flower garlands, parasols, flags and banners, or other different means, in particular with the music of various instruments and cymbals. Through that they will attain a continuous mental state of inner rejoicing that makes their bodily hair bristle with joy.

source: རིག་པའི་མཐུ་ཐོས་ནས་དགའ་བ་སྐྱེས་པ་འམ། རྗེས་སུ་ཡི་རང་བར་འགྱུར་བ་འམ།
en: Learning about the power and efficacy of vidyā s, they will be thrilled, rejoice, and

source: སྤྱོད་པ་ཐོབ་པར་འགྱུར་བ་དེ་དག་ནི་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་འགྱུར་བར་ལུང་བསྟན་ཏེ།
en: will take up the right conduct. I predict that all of them will become blessed buddhas, established in supreme, perfect awakening.

source: དེས་ན་རྒྱལ་བ་དེ་ལྟར་འཛུམ་པ་མཛད་ཀྱི་གཞན་དུ་ནི་མ་ཡིན་ནོ། །
en: It is for this and no other reason that the victorious ones smile. {8.6}

source: འདིར་དང་པོར་རེ་ཞིག་ཆོ་གའི་རྒྱལ་པོ་འདི་ལ་དམ་ཚིག་མཐོང་བ་སྔོན་དུ་བྱ་བ་རྣམས་བྱས་པ་དང་དབང་བསྐུར་བ་ཐོབ་པ། རྩ་བའི་སྔགས་སམ་སྙིང་པོ་འམ་ཉེ་བའི་སྙིང་པོ་འམ། སྔགས་གང་ཡང་རུང་བ་བཟུང་ནས་ཡི་གེ་གཅིག་པ་འམ། གང་འདོད་པ་དགོན་པ་ཆེན་པོར་སོང་སྟེ་
en: “To start, one who observes his samaya of, who has completed the preparatory rites for, and who has been ritually initiated into this king of manuals should choose either the root mantra, heart mantra, subsidiary heart mantra, or another mantra, whether of one syllable or another one as desired and go to a large forest.

source: འབུམ་ཕྲག་གསུམ་བཟླ་བར་བྱའོ། །
en: There one should recite the mantra three million times,

source: འབྲས་བུ་དང་ཆུས་འཚོ་བ་འམ། རྩ་བ་དང་། ལོ་མའི་བཟའ་བ་བྱས་ན།
en: living on fruits, water, roots, or leaves.

source: སྔོན་དུ་བྱ་བ་བྱས་པར་འགྱུར་རོ། །
en: This constitutes the preliminary practice. {8.7}

source: དེ་ནས་རིའི་རྩེ་མོར་འཛེགས་ནས་རས་རིས་ཆེན་པོའི་ཚད་ནུབ་ཕྱོགས་སུ་མངོན་དུ་ལྟ་བ་བཞག་པ་བྱས་ལ་བདག་ཉིད་ཤར་དུ་བལྟས་ཏེ།
en: “One should then climb to the top of a mountain and position the superior painting so that it faces the west.

source: ཀུ་ཤའི་ཁྲེས་ལ་འདུག་ནས། པདྨ་དཀར་པོ་ལ་ཙནྡན་དང་གུར་གུམ་གྱིས་བཏགས་ཏེ། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དང་། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་། རང་སངས་རྒྱས་དང་ཉན་ཐོས་དག་ལ་འབུམ་ཕྲག་གཅིག་རི་མོའི་རས་རིས་ཀྱི་འོག་ཏུ་དབུལ་བར་བྱའོ། །
en: Then, sitting on a bundle of kuśa grass and facing east, one should offer, below the painting, one hundred thousand white lotuses smeared with white sandalwood and saffron to Lord Śākyamuni and all the buddhas, bodhisattvas, pratyeka­buddhas, and noble śrāvakas.

source: ག་པུར་གྱི་བདུག་པ་ཡང་ཅི་འབྱོར་པས་བདུག་གོ། །
en: One should burn camphor incense according to one’s means

source: ལྷའི་བུ་དང་ཀླུ་རྣམས་ལ་ཡང་ཅི་རྙེད་པའི་མེ་ཏོག་གིས་མཆོད་པར་བྱའོ། །
en: and make offerings to the gods and nāga s of whatever flowers are available. {8.8}

source: དེ་ནས་མཚན་ཕྱེད་ཀྱི་དུས་སུ་ཆོ་འཕྲུལ་གྱི་ཟླ་ཕྱེད་ཀྱི་ཟླ་བ་ཉ་བ་ལ། རས་རིས་ཀྱི་མདུན་དུ་པདྨའི་རྣམ་པ་ལྟ་བུའི་མེ་ཐབ་བྱས་པ་ལ། ཙནྡན་དཀར་པོའི་ཤིང་གིས་མེ་སྦར་ནས
en: “Then, at the midnight hour, on a bright full moon night, the completely full moon of the prātihāra fortnight, one should dig, in front of the painting, a fire pit in the shape of a lotus and kindle the fire using white sandalwood sticks.

source: གུར་གུམ་དང་ག་པུར་བསྲེས་པས་སྲེག་བླུགས་ཅི་འབྱོར་པས་སྟོང་རྩ་བརྒྱད་སྦྱིན་སྲེག་བྱའོ། །
en: One should blend together saffron and camphor and offer it into the fire one thousand and eight times, [or as many times] as one can.

source: དེ་ནས་བསྲུང་བ་བྱའོ། །
en: [In this way] one becomes ritually protected. {8.9}

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལས་འོད་ཟེར་བྱུང་སྟེ། རས་ཀྱི་རི་མོའི་འཁོར་ཡུག་ནས་གཅིག་ཏུ་འབར་བར་འགྱུར་ཏེ།
en: “Then rays of light emanate from Lord Śākyamuni, encircle the painting, and envelop it with blazing light.

source: སྒྲུབ་པ་པོས་གུར་གུམ་དང་། ཙནྡན་གྱིས་བཏགས་པའི་ཙནྡན་དཀར་པོའི་མེ་ཏོག་གིས་མཆོད་ཡོན་དབུལ་ལོ། །དེ་ནས་སྒྲུབ་པ་པོས་རིངས་པའི་ཚུལ་གྱིས་རས་རིས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ།
en: The practitioner, in a form pleasing to beings, should then circumambulate the painting three times clockwise,

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་འཕགས་པ་ཉན་ཐོས་རྣམས་ལ་ཕྱག་བྱས་ནས།
en: bow to all the buddhas, bodhisattvas, pratyeka­buddhas, and noble śrāvakas,

source: སྒྲུབ་པ་པོས་བྲིས་པའི་རས་རིས་ཀྱི་མཐའ་མའི་ཕྱོགས་ནས་འཇིགས་པ་མེད་པས་རས་རིས་གཟུང་བར་བྱའོ། །དེ་ནས་བཟུང་བ་ཙམ་གྱིས་འཕུར་ཏེ།
en: and take the painting into his hands. {8.10} “As soon as one grasps the end of the cloth where the practitioner had been painted earlier, one will fly upward.

source: སེ་གོལ་གཏོགས་པ་ཙམ་གྱིས་ཚངས་པའི་འཇིག་རྟེན་དུ་ཕྱིན་པར་འགྱུར་ཏེ།
en: In the snap of a finger, one will ascend to the realm of Brahmā.

source: མེ་ཏོག་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་རབ་ཏུ་གནས་པར་འགྱུར་ཏེ། གང་དུ་བཅོམ་ལྡན་འདས་མེ་ཏོག་ཡང་དག་པར་སྐྱེས་པའི་རྒྱལ་པོའི་དབང་པོ་དེ་བཞིན་གཤེགས་པ་དེ་བཞུགས་ཏེ།
en: One will reach the world sphere called Kusumāvatī, where dwells Tathāgata Saṃkusumita Rājendra.

source: འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: There he upholds, maintains, and expounds the Dharma.

source: འཕགས་པ་འཇམ་དཔལ་ཡང་མངོན་དུ་མཐོང་ངོ་། །
en: One will see there Noble Mañjuśrī in person

source: ཆོས་ཀྱང་ཐོས་སོ། །
en: and will hear his Dharma discourse.

source: བྱང་ཆུབ་སེམས་དཔའ་དུ་མ་དག་ཀྱང་མཐོང་ཞིང་། དེ་དག་ལ་བསྙེན་བཀུར་ཡང་བྱེད་དེ་བསྐལ་པ་ཆེན་པོ་སྟོང་དུ་རྒ་བ་དང་འཆི་བ་མེད་ཅིང་གནས་པར་འགྱུར་རོ། །
en: One will also see many hundreds of thousands of bodhisattvas and attend upon them. One will live for one thousand great eons, enjoying freedom from old age and death. {8.11}

source: རས་རིས་ཀྱང་དེ་ན་གནས་པར་འགྱུར་རོ། །
en: “The painting also remains there

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ། །
en: and is blessed by all the buddhas and bodhisattvas;

source: དེ་དག་གིས་བྱིན་གྱིས་བརླབས་པར་ཡང་ཡང་དག་པར་ཤེས་སོ། །
en: one can clearly feel the blessing.

source: སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཡང་འདའ་བར་བྱེད་དོ། །
en: One will be able to visit hundreds of thousands of buddhafields,

source: ལུས་སྟོང་ཡང་སྟོན་པར་བྱེད་དོ། །
en: display hundreds of thousands of bodies,

source: རྫུ་འཕྲུལ་གྱི་མཐུ་དུ་མ་ཡང་འབྱིན་པར་བྱེད་དོ། །
en: and develop many magical powers.

source: འཕགས་པ་འཇམ་དཔལ་ཡང་དགེ་བའི་བཤེས་གཉེན་དུ་འགྱུར་རོ། །
en: Noble Mañjuśrī will become one’s spiritual friend,

source: ངེས་པར་བྱང་ཆུབ་ལ་གཞོལ་བར་འགྱུར་རོ། །
en: and one will be destined to attain awakening.” {8.12}

source: བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཕལ་པོ་ཆེ་ཐེག་པ་ཆེན་པོ་རྒྱ་ཆེ་བའི་མདོ་ལས། འཕགས་པ་འཇམ་དཔལ་གྱི་རྩ་བའི་ཆོ་ག་ཞིབ་མོ་རབ་འབྱམ་སྒྲུབ་པའི་ཐབས་མཆོག་གི་ལས་ཀྱི་ལེའུ་བརྒྱད་པ་ལས་དང་པོ་རྫོགས་སོ།། །།
en: This concludes the eighth chapter of this extensive Mahāyāna sūtra that forms a garland-like basket of bodhisattva teachings. This chapter constitutes the detailed first chapter on the ritual involving the supreme sādhana method.
